[
    {
        "tipo": "Sistema",
        "nome": "Agendador de mensagens - Sistema interno",
        "description": "Desenvolvi um sistema de agendamento de mensagens do WhatsApp, com o objetivo de agendar e enviar documentos e avisos para clientes de forma simultânea. <br><br>Para isso, utilizei uma API não oficial de envio de mensagens do WhatsApp, que se conecta por meio de QRCode. <br><br>O design do sistema é simples e se divide em poucas etapas: <br> - A primeira é a conexão com a API, que estabelece a conexão com a instância desejada;<br> - Em seguida, é possível criar o agendamento, definindo um nome para a tarefa, os contatos que receberão a mensagem, o conteúdo (seja texto ou mídia) e o horário em que a mensagem será enviada.<br>- Após o agendamento, ele é listado na dashboard, com opções de duplicação ou exclusão. <br><br>O sistema foi desenvolvido utilizando NodeJS, VueJS, MySQL e a API Evolution para o envio das mensagens. Além disso, implementei um controle sobre a quantidade de envios simultâneos durante os disparos, a fim de evitar o risco de banimento do número conectado.",
        "video": "agendador.mp4"
    },
    {
        "tipo": "Sistema",
        "nome": "Sistema de Leilões - Desenvolvido para cliente",
        "description": "Sistema para gerenciamento de leilões, com foco em registrar e acompanhar todas as etapas do processo, desde o início até o pós-venda. <br><br>Um dos maiores desafios foi a implementação da agenda e dos eventos. Após realizar pesquisas, escolhi o FullCalendar como ferramenta principal para a criação da agenda, devido à sua robustez e flexibilidade. <br><br>Com base nas necessidades específicas do cliente, implementei um sistema que permite a criação de eventos automaticamente, conforme os campos preenchidos nos leilões e as etapas percorridas durante o processo. <br><br>Entre as funcionalidades desenvolvidas estão o histórico de ações, que registra todas as atividades realizadas pelos usuários no sistema, notificações push e via e-mail para mantê-los informados, envio diário de e-mails automatizados utilizando CronJob do NodeJS e a configuração de permissões personalizadas para diferentes perfis de usuários.<br><br> Este foi o maior projeto em que trabalhei até o momento, e fui responsável por toda a sua elaboração. Para garantir uma coleta detalhada dos requisitos, realizei, junto ao meu superior, uma viagem à cidade da cliente para uma reunião presencial de alinhamento, o que foi fundamental para atender plenamente às expectativas do projeto.",
        "video": "leiloes.mp4"
    }
]