[
    {
        "tipo": "Site",
        "nome": "Músicas Brasileiras e suas Vertentes Artísticas",
        "description": "Projeto desenvolvido na faculdade para a disciplina de projeto prático.<br> O projeto consiste em divulgar a exposição que um grupo de alunos de uma faculdade realizou. <br>No site, podemos encontrar a descrição do projeto, os artistas que participaram e as obras que cada um desenvolveu para o projeto.<br> Ele foi desenvolvido com HTML, CSS e Javascript puro, pois foi um projeto em grupo, então para encaixar no nível técnico de todos, fizemos sem framework.",
        "thumb": "gifsProjetos/musicasBrasileiras.gif",
        "link": "https://musicas-brasileiras.vercel.app/"
    },
    {
        "tipo": "Site",
        "nome": "Soluciona Assessoria",
        "description": "O front-end foi desenvolvido inteiramente com o VueJS utilizando o Vue Router e Transitions. <br>Foi aplicado um back-end para listagem e inserção de posts no blog, utilizando PHP e Mysql.",
        "thumb": "gifsProjetos/solucionasite.gif",
        "link": "https://soluciona.inf.br"
    },
    {
        "tipo": "Site",
        "nome": "Cedray",
        "description": "O front-end foi desenvolvido inteiramente com o VueJS utilizando o Vue Router. <br>Desenvolvi um sistema parecido com um e-commerce, com a possibilidade de selecionar a variação do produto e a quantidade, mandar para o carrinho e solicitar um orçamento via WhatsApp com os produtos selecionados.",
        "thumb": "gifsProjetos/cedraysite.gif",
        "link": "https://cedray.com.br"
    },
    {
        "tipo": "Site",
        "nome": "Projeto Unique",
        "description": "Front-end desenvolvido com Handlebars pois desenvolvi antes de iniciar os estudos em VueJs.<br> No backend utilizei NodeJS e desenvolvi um ChatBot para o WhatsApp usado no projeto. Além disso, o projeto possui um formulário que as pessoas interessadas podem preencher e esses dados são salvos em um banco de dados Mysql.",
        "thumb": "gifsProjetos/projetouniquesite.gif",
        "link": "https://site.projetounique.ind.br"
    },
    {
        "tipo": "Site",
        "nome": "Loscrap",
        "description": "Front-end desenvolvido com HTML e CSS puro, pois desenvolvi antes de iniciar os estudos em VueJs",
        "thumb": "gifsProjetos/loscrapsite.gif",
        "link": "https://loscrap.ind.br"
    }
]